aivinjoseph/esp32c3-ota-demo/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
